# Задача 2. В первой строке файла находится информация 
# об ассортименте мороженного, во второй - информация о том, 
# какое мороженное есть на складе. Выведите названия того товара, который закончился.
# 1. «Сливочное», «Бурёнка», «Вафелька», «Сладкоежка»
# 2. «Сливочное», «Вафелька», «Сладкоежка»
# Закончилось: «Бурёнка»

Day1 = {"Сливочное", "Бурёнка", "Вафелька", "Сладкоежка"}
Day2 = {"Сливочное", "Вафелька", "Сладкоежка"}
Dl = Day1.difference(Day2)
print(f"Нет товара {Dl}")
