# Задача 3. Выведите число π с заданной точностью. 
# Точность выводится в виде десятичной дроби.
# 0.001 -> 3.142
# 0.00001 -> 3.14159

import math

n = int(input("Введите число n: "))
print(round(math.pi, n))